class ItemsController < ApplicationController

  before_action :authenticate_user!, only: [:new]
  before_action :set_categories, only: [:new, :create, :edit, :update]
  
  def index
    render 'items/index'
  end

  def new
    @item = Item.new
    @categories = [
      ["---", 0],
      ["メンズ", 1],
      ["レディース", 2],
      ["ベビー・キッズ", 3],
      ["インテリア・住まい・小物", 4],
      ["本・音楽・ゲーム", 5],
      ["おもちゃ・ホビー・グッズ", 6],
      ["家電・スマホ・カメラ", 7],
      ["スポーツ・レジャー", 8],
      ["ハンドメイド", 9],
      ["その他", 10]
    ]

    @shipping_fee_options = [
      ["---", "未選択"],
      ["着払い(購入者負担)", "着払い"],
      ["送料込み(出品者負担)", "送料込み"]
    ]

    @prefecture_options = [
      ["---", "---"],
      ["北海道", "北海道"],
      ["青森県", "青森県"],
      ["岩手県", "岩手県"],
      ["宮城県", "宮城県"],
      ["秋田県", "秋田県"],
      ["山形県", "山形県"],
      ["福島県", "福島県"],
      ["茨城県", "茨城県"],
      ["栃木県", "栃木県"],
      ["群馬県", "群馬県"],
      ["埼玉県", "埼玉県"],
      ["千葉県", "千葉県"],
      ["東京都", "東京都"],
      ["神奈川県", "神奈川県"],
      ["新潟県", "新潟県"],
      ["富山県", "富山県"],
      ["石川県", "石川県"],
      ["福井県", "福井県"],
      ["山梨県", "山梨県"],
      ["長野県", "長野県"],
      ["岐阜県", "岐阜県"],
      ["静岡県", "静岡県"],
      ["愛知県", "愛知県"],
      ["三重県", "三重県"],
      ["滋賀県", "滋賀県"],
      ["京都府", "京都府"],
      ["大阪府", "大阪府"],
      ["兵庫県", "兵庫県"],
      ["奈良県", "奈良県"],
      ["和歌山県", "和歌山県"],
      ["鳥取県", "鳥取県"],
      ["島根県", "島根県"],
      ["岡山県", "岡山県"],
      ["広島県", "広島県"],
      ["山口県", "山口県"],
      ["徳島県", "徳島県"],
      ["香川県", "香川県"],
      ["愛媛県", "愛媛県"],
      ["高知県", "高知県"],
      ["福岡県", "福岡県"],
      ["佐賀県", "佐賀県"],
      ["長崎県", "長崎県"],
      ["熊本県", "熊本県"],
      ["大分県", "大分県"],
      ["宮崎県", "宮崎県"],
      ["鹿児島県", "鹿児島県"],
      ["沖縄県", "沖縄県"]
    ]    
  end

  def create
    @item = current_user.items.build(item_params)
    
    if @item.save
      respond_to do |format|
        format.html { redirect_to root_path, notice: '商品が出品されました。' }
        format.js  { render js: "window.location.replace('#{root_path}');" }
      end
    else
      @categories = Category.all
      @shipping_fee_options = [["---", "未選択"], ["着払い(購入者負担)", "着払い"], ["送料込み(出品者負担)", "送料込み"]]
      @prefecture_options = [
        ["---", "---"],
        ["北海道", "北海道"],
        ["青森県", "青森県"],
        ["岩手県", "岩手県"],
        ["宮城県", "宮城県"],
        ["秋田県", "秋田県"],
        ["山形県", "山形県"],
        ["福島県", "福島県"],
        ["茨城県", "茨城県"],
        ["栃木県", "栃木県"],
        ["群馬県", "群馬県"],
        ["埼玉県", "埼玉県"],
        ["千葉県", "千葉県"],
        ["東京都", "東京都"],
        ["神奈川県", "神奈川県"],
        ["新潟県", "新潟県"],
        ["富山県", "富山県"],
        ["石川県", "石川県"],
        ["福井県", "福井県"],
        ["山梨県", "山梨県"],
        ["長野県", "長野県"],
        ["岐阜県", "岐阜県"],
        ["静岡県", "静岡県"],
        ["愛知県", "愛知県"],
        ["三重県", "三重県"],
        ["滋賀県", "滋賀県"],
        ["京都府", "京都府"],
        ["大阪府", "大阪府"],
        ["兵庫県", "兵庫県"],
        ["奈良県", "奈良県"],
        ["和歌山県", "和歌山県"],
        ["鳥取県", "鳥取県"],
        ["島根県", "島根県"],
        ["岡山県", "岡山県"],
        ["広島県", "広島県"],
        ["山口県", "山口県"],
        ["徳島県", "徳島県"],
        ["香川県", "香川県"],
        ["愛媛県", "愛媛県"],
        ["高知県", "高知県"],
        ["福岡県", "福岡県"],
        ["佐賀県", "佐賀県"],
        ["長崎県", "長崎県"],
        ["熊本県", "熊本県"],
        ["大分県", "大分県"],
        ["宮崎県", "宮崎県"],
        ["鹿児島県", "鹿児島県"],
        ["沖縄県", "沖縄県"]
      ]
    respond_to do |format|
      format.html { render :new }
      format.js { render :create_error }
    end
    end
  end
  
  private

  def set_categories
    @categories = Category.all
  end  
  
  def item_params
    params.require(:item).permit(:image, :name, :description, :category_id, :status, :shipping_fee_status, :prefecture, :scheduled_delivery, :price)
  end  
  
end
